MikroElektronika/core_packages/PIC/XC8/def/PIC12F617/mcu.h
// Register: FSR
#define FSR FSR
extern volatile unsigned char           FSR                 __at(0x004);
#ifndef _LIB_BUILD
asm("FSR equ 04h");
#endif

// Register: GPIO
#define GPIO GPIO
extern volatile unsigned char           GPIO                __at(0x005);
#ifndef _LIB_BUILD
asm("GPIO equ 05h");
#endif
// aliases
extern volatile unsigned char           PORTA               __at(0x005);
#ifndef _LIB_BUILD
asm("PORTA equ 05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GP0                    :1;
        unsigned GP1                    :1;
        unsigned GP2                    :1;
        unsigned GP3                    :1;
        unsigned GP4                    :1;
        unsigned GP5                    :1;
    };
    struct {
        unsigned GPIO0                  :1;
        unsigned GPIO1                  :1;
        unsigned GPIO2                  :1;
        unsigned GPIO3                  :1;
        unsigned GPIO4                  :1;
        unsigned GPIO5                  :1;
    };
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
    };
} GPIObits_t;
extern volatile GPIObits_t GPIObits __at(0x005);
// bitfield macros
#define _GPIO_GP0_POSN                                      0x0
#define _GPIO_GP0_POSITION                                  0x0
#define _GPIO_GP0_SIZE                                      0x1
#define _GPIO_GP0_LENGTH                                    0x1
#define _GPIO_GP0_MASK                                      0x1
#define _GPIO_GP1_POSN                                      0x1
#define _GPIO_GP1_POSITION                                  0x1
#define _GPIO_GP1_SIZE                                      0x1
#define _GPIO_GP1_LENGTH                                    0x1
#define _GPIO_GP1_MASK                                      0x2
#define _GPIO_GP2_POSN                                      0x2
#define _GPIO_GP2_POSITION                                  0x2
#define _GPIO_GP2_SIZE                                      0x1
#define _GPIO_GP2_LENGTH                                    0x1
#define _GPIO_GP2_MASK                                      0x4
#define _GPIO_GP3_POSN                                      0x3
#define _GPIO_GP3_POSITION                                  0x3
#define _GPIO_GP3_SIZE                                      0x1
#define _GPIO_GP3_LENGTH                                    0x1
#define _GPIO_GP3_MASK                                      0x8
#define _GPIO_GP4_POSN                                      0x4
#define _GPIO_GP4_POSITION                                  0x4
#define _GPIO_GP4_SIZE                                      0x1
#define _GPIO_GP4_LENGTH                                    0x1
#define _GPIO_GP4_MASK                                      0x10
#define _GPIO_GP5_POSN                                      0x5
#define _GPIO_GP5_POSITION                                  0x5
#define _GPIO_GP5_SIZE                                      0x1
#define _GPIO_GP5_LENGTH                                    0x1
#define _GPIO_GP5_MASK                                      0x20
#define _GPIO_GPIO0_POSN                                    0x0
#define _GPIO_GPIO0_POSITION                                0x0
#define _GPIO_GPIO0_SIZE                                    0x1
#define _GPIO_GPIO0_LENGTH                                  0x1
#define _GPIO_GPIO0_MASK                                    0x1
#define _GPIO_GPIO1_POSN                                    0x1
#define _GPIO_GPIO1_POSITION                                0x1
#define _GPIO_GPIO1_SIZE                                    0x1
#define _GPIO_GPIO1_LENGTH                                  0x1
#define _GPIO_GPIO1_MASK                                    0x2
#define _GPIO_GPIO2_POSN                                    0x2
#define _GPIO_GPIO2_POSITION                                0x2
#define _GPIO_GPIO2_SIZE                                    0x1
#define _GPIO_GPIO2_LENGTH                                  0x1
#define _GPIO_GPIO2_MASK                                    0x4
#define _GPIO_GPIO3_POSN                                    0x3
#define _GPIO_GPIO3_POSITION                                0x3
#define _GPIO_GPIO3_SIZE                                    0x1
#define _GPIO_GPIO3_LENGTH                                  0x1
#define _GPIO_GPIO3_MASK                                    0x8
#define _GPIO_GPIO4_POSN                                    0x4
#define _GPIO_GPIO4_POSITION                                0x4
#define _GPIO_GPIO4_SIZE                                    0x1
#define _GPIO_GPIO4_LENGTH                                  0x1
#define _GPIO_GPIO4_MASK                                    0x10
#define _GPIO_GPIO5_POSN                                    0x5
#define _GPIO_GPIO5_POSITION                                0x5
#define _GPIO_GPIO5_SIZE                                    0x1
#define _GPIO_GPIO5_LENGTH                                  0x1
#define _GPIO_GPIO5_MASK                                    0x20
#define _GPIO_RA0_POSN                                      0x0
#define _GPIO_RA0_POSITION                                  0x0
#define _GPIO_RA0_SIZE                                      0x1
#define _GPIO_RA0_LENGTH                                    0x1
#define _GPIO_RA0_MASK                                      0x1
#define _GPIO_RA1_POSN                                      0x1
#define _GPIO_RA1_POSITION                                  0x1
#define _GPIO_RA1_SIZE                                      0x1
#define _GPIO_RA1_LENGTH                                    0x1
#define _GPIO_RA1_MASK                                      0x2
#define _GPIO_RA2_POSN                                      0x2
#define _GPIO_RA2_POSITION                                  0x2
#define _GPIO_RA2_SIZE                                      0x1
#define _GPIO_RA2_LENGTH                                    0x1
#define _GPIO_RA2_MASK                                      0x4
#define _GPIO_RA3_POSN                                      0x3
#define _GPIO_RA3_POSITION                                  0x3
#define _GPIO_RA3_SIZE                                      0x1
#define _GPIO_RA3_LENGTH                                    0x1
#define _GPIO_RA3_MASK                                      0x8
#define _GPIO_RA4_POSN                                      0x4
#define _GPIO_RA4_POSITION                                  0x4
#define _GPIO_RA4_SIZE                                      0x1
#define _GPIO_RA4_LENGTH                                    0x1
#define _GPIO_RA4_MASK                                      0x10
#define _GPIO_RA5_POSN                                      0x5
#define _GPIO_RA5_POSITION                                  0x5
#define _GPIO_RA5_SIZE                                      0x1
#define _GPIO_RA5_LENGTH                                    0x1
#define _GPIO_RA5_MASK                                      0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned GP0                    :1;
        unsigned GP1                    :1;
        unsigned GP2                    :1;
        unsigned GP3                    :1;
        unsigned GP4                    :1;
        unsigned GP5                    :1;
    };
    struct {
        unsigned GPIO0                  :1;
        unsigned GPIO1                  :1;
        unsigned GPIO2                  :1;
        unsigned GPIO3                  :1;
        unsigned GPIO4                  :1;
        unsigned GPIO5                  :1;
    };
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0x005);
// bitfield macros
#define _PORTA_GP0_POSN                                     0x0
#define _PORTA_GP0_POSITION                                 0x0
#define _PORTA_GP0_SIZE                                     0x1
#define _PORTA_GP0_LENGTH                                   0x1
#define _PORTA_GP0_MASK                                     0x1
#define _PORTA_GP1_POSN                                     0x1
#define _PORTA_GP1_POSITION                                 0x1
#define _PORTA_GP1_SIZE                                     0x1
#define _PORTA_GP1_LENGTH                                   0x1
#define _PORTA_GP1_MASK                                     0x2
#define _PORTA_GP2_POSN                                     0x2
#define _PORTA_GP2_POSITION                                 0x2
#define _PORTA_GP2_SIZE                                     0x1
#define _PORTA_GP2_LENGTH                                   0x1
#define _PORTA_GP2_MASK                                     0x4
#define _PORTA_GP3_POSN                                     0x3
#define _PORTA_GP3_POSITION                                 0x3
#define _PORTA_GP3_SIZE                                     0x1
#define _PORTA_GP3_LENGTH                                   0x1
#define _PORTA_GP3_MASK                                     0x8
#define _PORTA_GP4_POSN                                     0x4
#define _PORTA_GP4_POSITION                                 0x4
#define _PORTA_GP4_SIZE                                     0x1
#define _PORTA_GP4_LENGTH                                   0x1
#define _PORTA_GP4_MASK                                     0x10
#define _PORTA_GP5_POSN                                     0x5
#define _PORTA_GP5_POSITION                                 0x5
#define _PORTA_GP5_SIZE                                     0x1
#define _PORTA_GP5_LENGTH                                   0x1
#define _PORTA_GP5_MASK                                     0x20
#define _PORTA_GPIO0_POSN                                   0x0
#define _PORTA_GPIO0_POSITION                               0x0
#define _PORTA_GPIO0_SIZE                                   0x1
#define _PORTA_GPIO0_LENGTH                                 0x1
#define _PORTA_GPIO0_MASK                                   0x1
#define _PORTA_GPIO1_POSN                                   0x1
#define _PORTA_GPIO1_POSITION                               0x1
#define _PORTA_GPIO1_SIZE                                   0x1
#define _PORTA_GPIO1_LENGTH                                 0x1
#define _PORTA_GPIO1_MASK                                   0x2
#define _PORTA_GPIO2_POSN                                   0x2
#define _PORTA_GPIO2_POSITION                               0x2
#define _PORTA_GPIO2_SIZE                                   0x1
#define _PORTA_GPIO2_LENGTH                                 0x1
#define _PORTA_GPIO2_MASK                                   0x4
#define _PORTA_GPIO3_POSN                                   0x3
#define _PORTA_GPIO3_POSITION                               0x3
#define _PORTA_GPIO3_SIZE                                   0x1
#define _PORTA_GPIO3_LENGTH                                 0x1
#define _PORTA_GPIO3_MASK                                   0x8
#define _PORTA_GPIO4_POSN                                   0x4
#define _PORTA_GPIO4_POSITION                               0x4
#define _PORTA_GPIO4_SIZE                                   0x1
#define _PORTA_GPIO4_LENGTH                                 0x1
#define _PORTA_GPIO4_MASK                                   0x10
#define _PORTA_GPIO5_POSN                                   0x5
#define _PORTA_GPIO5_POSITION                               0x5
#define _PORTA_GPIO5_SIZE                                   0x1
#define _PORTA_GPIO5_LENGTH                                 0x1
#define _PORTA_GPIO5_MASK                                   0x20
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0x00A);
#ifndef _LIB_BUILD
asm("PCLATH equ 0Ah");
#endif

// Register: INTCON
#define INTCON INTCON
extern volatile unsigned char           INTCON              __at(0x00B);
#ifndef _LIB_BUILD
asm("INTCON equ 0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GPIF                   :1;
        unsigned INTF                   :1;
        unsigned T0IF                   :1;
        unsigned GPIE                   :1;
        unsigned INTE                   :1;
        unsigned T0IE                   :1;
        unsigned PEIE                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned TMR0IF                 :1;
        unsigned                        :2;
        unsigned TMR0IE                 :1;
    };
} INTCONbits_t;
extern volatile INTCONbits_t INTCONbits __at(0x00B);
// bitfield macros
#define _INTCON_GPIF_POSN                                   0x0
#define _INTCON_GPIF_POSITION                               0x0
#define _INTCON_GPIF_SIZE                                   0x1
#define _INTCON_GPIF_LENGTH                                 0x1
#define _INTCON_GPIF_MASK                                   0x1
#define _INTCON_INTF_POSN                                   0x1
#define _INTCON_INTF_POSITION                               0x1
#define _INTCON_INTF_SIZE                                   0x1
#define _INTCON_INTF_LENGTH                                 0x1
#define _INTCON_INTF_MASK                                   0x2
#define _INTCON_T0IF_POSN                                   0x2
#define _INTCON_T0IF_POSITION                               0x2
#define _INTCON_T0IF_SIZE                                   0x1
#define _INTCON_T0IF_LENGTH                                 0x1
#define _INTCON_T0IF_MASK                                   0x4
#define _INTCON_GPIE_POSN                                   0x3
#define _INTCON_GPIE_POSITION                               0x3
#define _INTCON_GPIE_SIZE                                   0x1
#define _INTCON_GPIE_LENGTH                                 0x1
#define _INTCON_GPIE_MASK                                   0x8
#define _INTCON_INTE_POSN                                   0x4
#define _INTCON_INTE_POSITION                               0x4
#define _INTCON_INTE_SIZE                                   0x1
#define _INTCON_INTE_LENGTH                                 0x1
#define _INTCON_INTE_MASK                                   0x10
#define _INTCON_T0IE_POSN                                   0x5
#define _INTCON_T0IE_POSITION                               0x5
#define _INTCON_T0IE_SIZE                                   0x1
#define _INTCON_T0IE_LENGTH                                 0x1
#define _INTCON_T0IE_MASK                                   0x20
#define _INTCON_PEIE_POSN                                   0x6
#define _INTCON_PEIE_POSITION                               0x6
#define _INTCON_PEIE_SIZE                                   0x1
#define _INTCON_PEIE_LENGTH                                 0x1
#define _INTCON_PEIE_MASK                                   0x40
#define _INTCON_GIE_POSN                                    0x7
#define _INTCON_GIE_POSITION                                0x7
#define _INTCON_GIE_SIZE                                    0x1
#define _INTCON_GIE_LENGTH                                  0x1
#define _INTCON_GIE_MASK                                    0x80
#define _INTCON_TMR0IF_POSN                                 0x2
#define _INTCON_TMR0IF_POSITION                             0x2
#define _INTCON_TMR0IF_SIZE                                 0x1
#define _INTCON_TMR0IF_LENGTH                               0x1
#define _INTCON_TMR0IF_MASK                                 0x4
#define _INTCON_TMR0IE_POSN                                 0x5
#define _INTCON_TMR0IE_POSITION                             0x5
#define _INTCON_TMR0IE_SIZE                                 0x1
#define _INTCON_TMR0IE_LENGTH                               0x1
#define _INTCON_TMR0IE_MASK                                 0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x00C);
#ifndef _LIB_BUILD
asm("PIR1 equ 0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned                        :1;
        unsigned CMIF                   :1;
        unsigned                        :1;
        unsigned CCP1IF                 :1;
        unsigned ADIF                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned C1IF                   :1;
        unsigned                        :1;
        unsigned CCPIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned ECCPIF                 :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x00C);
// bitfield macros
#define _PIR1_TMR1IF_POSN                                   0x0
#define _PIR1_TMR1IF_POSITION                               0x0
#define _PIR1_TMR1IF_SIZE                                   0x1
#define _PIR1_TMR1IF_LENGTH                                 0x1
#define _PIR1_TMR1IF_MASK                                   0x1
#define _PIR1_TMR2IF_POSN                                   0x1
#define _PIR1_TMR2IF_POSITION                               0x1
#define _PIR1_TMR2IF_SIZE                                   0x1
#define _PIR1_TMR2IF_LENGTH                                 0x1
#define _PIR1_TMR2IF_MASK                                   0x2
#define _PIR1_CMIF_POSN                                     0x3
#define _PIR1_CMIF_POSITION                                 0x3
#define _PIR1_CMIF_SIZE                                     0x1
#define _PIR1_CMIF_LENGTH                                   0x1
#define _PIR1_CMIF_MASK                                     0x8
#define _PIR1_CCP1IF_POSN                                   0x5
#define _PIR1_CCP1IF_POSITION                               0x5
#define _PIR1_CCP1IF_SIZE                                   0x1
#define _PIR1_CCP1IF_LENGTH                                 0x1
#define _PIR1_CCP1IF_MASK                                   0x20
#define _PIR1_ADIF_POSN                                     0x6
#define _PIR1_ADIF_POSITION                                 0x6
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x40
#define _PIR1_C1IF_POSN                                     0x3
#define _PIR1_C1IF_POSITION                                 0x3
#define _PIR1_C1IF_SIZE                                     0x1
#define _PIR1_C1IF_LENGTH                                   0x1
#define _PIR1_C1IF_MASK                                     0x8
#define _PIR1_CCPIF_POSN                                    0x5
#define _PIR1_CCPIF_POSITION                                0x5
#define _PIR1_CCPIF_SIZE                                    0x1
#define _PIR1_CCPIF_LENGTH                                  0x1
#define _PIR1_CCPIF_MASK                                    0x20
#define _PIR1_ECCPIF_POSN                                   0x5
#define _PIR1_ECCPIF_POSITION                               0x5
#define _PIR1_ECCPIF_SIZE                                   0x1
#define _PIR1_ECCPIF_LENGTH                                 0x1
#define _PIR1_ECCPIF_MASK                                   0x20

// Register: TMR1
#define TMR1 TMR1
extern volatile unsigned short          TMR1                __at(0x00E);
#ifndef _LIB_BUILD
asm("TMR1 equ 0Eh");
#endif

// Register: TMR1L
#define TMR1L TMR1L
extern volatile unsigned char           TMR1L               __at(0x00E);
#ifndef _LIB_BUILD
asm("TMR1L equ 0Eh");
#endif

// Register: TMR1H
#define TMR1H TMR1H
extern volatile unsigned char           TMR1H               __at(0x00F);
#ifndef _LIB_BUILD
asm("TMR1H equ 0Fh");
#endif

