MikroElektronika/core_packages/PIC/XC8/def/PIC12F617/mcu.h
// Register: PMDATH
#define PMDATH PMDATH
extern volatile unsigned char           PMDATH              __at(0x09D);
#ifndef _LIB_BUILD
asm("PMDATH equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMDATH                 :6;
    };
} PMDATHbits_t;
extern volatile PMDATHbits_t PMDATHbits __at(0x09D);
// bitfield macros
#define _PMDATH_PMDATH_POSN                                 0x0
#define _PMDATH_PMDATH_POSITION                             0x0
#define _PMDATH_PMDATH_SIZE                                 0x6
#define _PMDATH_PMDATH_LENGTH                               0x6
#define _PMDATH_PMDATH_MASK                                 0x3F

// Register: ADRESL
#define ADRESL ADRESL
extern volatile unsigned char           ADRESL              __at(0x09E);
#ifndef _LIB_BUILD
asm("ADRESL equ 09Eh");
#endif

// Register: ANSEL
#define ANSEL ANSEL
extern volatile unsigned char           ANSEL               __at(0x09F);
#ifndef _LIB_BUILD
asm("ANSEL equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS                    :4;
        unsigned ADCS                   :3;
    };
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
    };
} ANSELbits_t;
extern volatile ANSELbits_t ANSELbits __at(0x09F);
// bitfield macros
#define _ANSEL_ANS_POSN                                     0x0
#define _ANSEL_ANS_POSITION                                 0x0
#define _ANSEL_ANS_SIZE                                     0x4
#define _ANSEL_ANS_LENGTH                                   0x4
#define _ANSEL_ANS_MASK                                     0xF
#define _ANSEL_ADCS_POSN                                    0x4
#define _ANSEL_ADCS_POSITION                                0x4
#define _ANSEL_ADCS_SIZE                                    0x3
#define _ANSEL_ADCS_LENGTH                                  0x3
#define _ANSEL_ADCS_MASK                                    0x70
#define _ANSEL_ANS0_POSN                                    0x0
#define _ANSEL_ANS0_POSITION                                0x0
#define _ANSEL_ANS0_SIZE                                    0x1
#define _ANSEL_ANS0_LENGTH                                  0x1
#define _ANSEL_ANS0_MASK                                    0x1
#define _ANSEL_ANS1_POSN                                    0x1
#define _ANSEL_ANS1_POSITION                                0x1
#define _ANSEL_ANS1_SIZE                                    0x1
#define _ANSEL_ANS1_LENGTH                                  0x1
#define _ANSEL_ANS1_MASK                                    0x2
#define _ANSEL_ANS2_POSN                                    0x2
#define _ANSEL_ANS2_POSITION                                0x2
#define _ANSEL_ANS2_SIZE                                    0x1
#define _ANSEL_ANS2_LENGTH                                  0x1
#define _ANSEL_ANS2_MASK                                    0x4
#define _ANSEL_ANS3_POSN                                    0x3
#define _ANSEL_ANS3_POSITION                                0x3
#define _ANSEL_ANS3_SIZE                                    0x1
#define _ANSEL_ANS3_LENGTH                                  0x1
#define _ANSEL_ANS3_MASK                                    0x8
#define _ANSEL_ADCS0_POSN                                   0x4
#define _ANSEL_ADCS0_POSITION                               0x4
#define _ANSEL_ADCS0_SIZE                                   0x1
#define _ANSEL_ADCS0_LENGTH                                 0x1
#define _ANSEL_ADCS0_MASK                                   0x10
#define _ANSEL_ADCS1_POSN                                   0x5
#define _ANSEL_ADCS1_POSITION                               0x5
#define _ANSEL_ADCS1_SIZE                                   0x1
#define _ANSEL_ADCS1_LENGTH                                 0x1
#define _ANSEL_ADCS1_MASK                                   0x20
#define _ANSEL_ADCS2_POSN                                   0x6
#define _ANSEL_ADCS2_POSITION                               0x6
#define _ANSEL_ADCS2_SIZE                                   0x1
#define _ANSEL_ADCS2_LENGTH                                 0x1
#define _ANSEL_ADCS2_MASK                                   0x40

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ANSEL<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4FC);	// @ (0x9F * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ANSEL,4)
// ANSEL<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4FD);	// @ (0x9F * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ANSEL,5)
// ANSEL<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4FE);	// @ (0x9F * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ANSEL,6)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANSEL<ANS0>
extern volatile __bit                   ANS0                __at(0x4F8);	// @ (0x9F * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL,0)
// ANSEL<ANS1>
extern volatile __bit                   ANS1                __at(0x4F9);	// @ (0x9F * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL,1)
// ANSEL<ANS2>
extern volatile __bit                   ANS2                __at(0x4FA);	// @ (0x9F * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL,2)
// ANSEL<ANS3>
extern volatile __bit                   ANS3                __at(0x4FB);	// @ (0x9F * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL,3)
// CMCON0<C1CH>
extern volatile __bit                   C1CH                __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 C1CH_bit            _BIT_ACCESS(CMCON0,0)
// CMCON1<C1HYS>
extern volatile __bit                   C1HYS               __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 C1HYS_bit           _BIT_ACCESS(CMCON1,3)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,3)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x63);	// @ (0xC * 8 + 3)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,3)
// CMCON0<C1OE>
extern volatile __bit                   C1OE                __at(0xD5);	// @ (0x1A * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CMCON0,5)
// CMCON0<C1ON>
extern volatile __bit                   C1ON                __at(0xD7);	// @ (0x1A * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CMCON0,7)
// CMCON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0xD6);	// @ (0x1A * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON0,6)
// CMCON0<C1POL>
extern volatile __bit                   C1POL               __at(0xD4);	// @ (0x1A * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CMCON0,4)
// CMCON0<C1R>
extern volatile __bit                   C1R                 __at(0xD2);	// @ (0x1A * 8 + 2)
#define                                 C1R_bit             _BIT_ACCESS(CMCON0,2)
// CMCON1<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CMCON1,0)
// VRCON<C1VREN>
extern volatile __bit                   C1VREN              __at(0xCF);	// @ (0x19 * 8 + 7)
#define                                 C1VREN_bit          _BIT_ACCESS(VRCON,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,5)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x65);	// @ (0xC * 8 + 5)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,5)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PIE1<CCPIE>
extern volatile __bit                   CCPIE               __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 CCPIE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<CCPIF>
extern volatile __bit                   CCPIF               __at(0x65);	// @ (0xC * 8 + 5)
#define                                 CCPIF_bit           _BIT_ACCESS(PIR1,5)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// CMCON0<CMCH>
extern volatile __bit                   CMCH                __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 CMCH_bit            _BIT_ACCESS(CMCON0,0)
// CMCON1<CMHYS>
extern volatile __bit                   CMHYS               __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 CMHYS_bit           _BIT_ACCESS(CMCON1,3)
// PIE1<CMIE>
extern volatile __bit                   CMIE                __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 CMIE_bit            _BIT_ACCESS(PIE1,3)
// PIR1<CMIF>
extern volatile __bit                   CMIF                __at(0x63);	// @ (0xC * 8 + 3)
#define                                 CMIF_bit            _BIT_ACCESS(PIR1,3)
// CMCON0<CMOE>
extern volatile __bit                   CMOE                __at(0xD5);	// @ (0x1A * 8 + 5)
#define                                 CMOE_bit            _BIT_ACCESS(CMCON0,5)
// CMCON0<CMON>
extern volatile __bit                   CMON                __at(0xD7);	// @ (0x1A * 8 + 7)
#define                                 CMON_bit            _BIT_ACCESS(CMCON0,7)
// CMCON0<CMPOL>
extern volatile __bit                   CMPOL               __at(0xD4);	// @ (0x1A * 8 + 4)
#define                                 CMPOL_bit           _BIT_ACCESS(CMCON0,4)
// CMCON0<CMR>
extern volatile __bit                   CMR                 __at(0xD2);	// @ (0x1A * 8 + 2)
#define                                 CMR_bit             _BIT_ACCESS(CMCON0,2)
// CMCON1<CMSYNC>
extern volatile __bit                   CMSYNC              __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 CMSYNC_bit          _BIT_ACCESS(CMCON1,0)
// VRCON<CMVREN>
extern volatile __bit                   CMVREN              __at(0xCF);	// @ (0x19 * 8 + 7)
#define                                 CMVREN_bit          _BIT_ACCESS(VRCON,7)
// CMCON0<COUT>
extern volatile __bit                   COUT                __at(0xD6);	// @ (0x1A * 8 + 6)
#define                                 COUT_bit            _BIT_ACCESS(CMCON0,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DCB0>
extern volatile __bit                   DCB0                __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 DCB0_bit            _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DCB1>
extern volatile __bit                   DCB1                __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 DCB1_bit            _BIT_ACCESS(CCP1CON,5)
// ECCPAS<ECCPAS0>
extern volatile __bit                   ECCPAS0             __at(0xBC);	// @ (0x17 * 8 + 4)
#define                                 ECCPAS0_bit         _BIT_ACCESS(ECCPAS,4)
// ECCPAS<ECCPAS1>
extern volatile __bit                   ECCPAS1             __at(0xBD);	// @ (0x17 * 8 + 5)
#define                                 ECCPAS1_bit         _BIT_ACCESS(ECCPAS,5)
// ECCPAS<ECCPAS2>
extern volatile __bit                   ECCPAS2             __at(0xBE);	// @ (0x17 * 8 + 6)
#define                                 ECCPAS2_bit         _BIT_ACCESS(ECCPAS,6)
// ECCPAS<ECCPASE>
extern volatile __bit                   ECCPASE             __at(0xBF);	// @ (0x17 * 8 + 7)
#define                                 ECCPASE_bit         _BIT_ACCESS(ECCPAS,7)
// PIE1<ECCPIE>
extern volatile __bit                   ECCPIE              __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 ECCPIE_bit          _BIT_ACCESS(PIE1,5)
// PIR1<ECCPIF>
extern volatile __bit                   ECCPIF              __at(0x65);	// @ (0xC * 8 + 5)
#define                                 ECCPIF_bit          _BIT_ACCESS(PIR1,5)
// VRCON<FVREN>
extern volatile __bit                   FVREN               __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 FVREN_bit           _BIT_ACCESS(VRCON,4)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// GPIO<GP0>
extern volatile __bit                   GP0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 GP0_bit             _BIT_ACCESS(GPIO,0)
// GPIO<GP1>
extern volatile __bit                   GP1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 GP1_bit             _BIT_ACCESS(GPIO,1)
// GPIO<GP2>
extern volatile __bit                   GP2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 GP2_bit             _BIT_ACCESS(GPIO,2)
// GPIO<GP3>
extern volatile __bit                   GP3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 GP3_bit             _BIT_ACCESS(GPIO,3)
// GPIO<GP4>
extern volatile __bit                   GP4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 GP4_bit             _BIT_ACCESS(GPIO,4)
// GPIO<GP5>
extern volatile __bit                   GP5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 GP5_bit             _BIT_ACCESS(GPIO,5)
// INTCON<GPIE>
extern volatile __bit                   GPIE                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 GPIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<GPIF>
extern volatile __bit                   GPIF                __at(0x58);	// @ (0xB * 8 + 0)
#define                                 GPIF_bit            _BIT_ACCESS(INTCON,0)
// GPIO<GPIO0>
extern volatile __bit                   GPIO0               __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 GPIO0_bit           _BIT_ACCESS(GPIO,0)
// GPIO<GPIO1>
extern volatile __bit                   GPIO1               __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 GPIO1_bit           _BIT_ACCESS(GPIO,1)
// GPIO<GPIO2>
extern volatile __bit                   GPIO2               __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 GPIO2_bit           _BIT_ACCESS(GPIO,2)
// GPIO<GPIO3>
extern volatile __bit                   GPIO3               __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 GPIO3_bit           _BIT_ACCESS(GPIO,3)
// GPIO<GPIO4>
extern volatile __bit                   GPIO4               __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 GPIO4_bit           _BIT_ACCESS(GPIO,4)
// GPIO<GPIO5>
extern volatile __bit                   GPIO5               __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 GPIO5_bit           _BIT_ACCESS(GPIO,5)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOC<IOC0>
extern volatile __bit                   IOC0                __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOC0_bit            _BIT_ACCESS(IOC,0)
// IOC<IOC1>
extern volatile __bit                   IOC1                __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOC1_bit            _BIT_ACCESS(IOC,1)
// IOC<IOC2>
extern volatile __bit                   IOC2                __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOC2_bit            _BIT_ACCESS(IOC,2)
// IOC<IOC3>
extern volatile __bit                   IOC3                __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOC3_bit            _BIT_ACCESS(IOC,3)
// IOC<IOC4>
extern volatile __bit                   IOC4                __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOC4_bit            _BIT_ACCESS(IOC,4)
// IOC<IOC5>
extern volatile __bit                   IOC5                __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOC5_bit            _BIT_ACCESS(IOC,5)
// IOC<IOCA0>
extern volatile __bit                   IOCA0               __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOCA0_bit           _BIT_ACCESS(IOC,0)
// IOC<IOCA1>
extern volatile __bit                   IOCA1               __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOCA1_bit           _BIT_ACCESS(IOC,1)
// IOC<IOCA2>
extern volatile __bit                   IOCA2               __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOCA2_bit           _BIT_ACCESS(IOC,2)
// IOC<IOCA3>
extern volatile __bit                   IOCA3               __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOCA3_bit           _BIT_ACCESS(IOC,3)
// IOC<IOCA4>
extern volatile __bit                   IOCA4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCA4_bit           _BIT_ACCESS(IOC,4)
// IOC<IOCA5>
extern volatile __bit                   IOCA5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCA5_bit           _BIT_ACCESS(IOC,5)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// APFCON<P1ASEL>
extern volatile __bit                   P1ASEL              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 P1ASEL_bit          _BIT_ACCESS(APFCON,0)
// APFCON<P1BSEL>
extern volatile __bit                   P1BSEL              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 P1BSEL_bit          _BIT_ACCESS(APFCON,1)
// CCP1CON<P1M>
extern volatile __bit                   P1M                 __at(0xAF);	// @ (0x15 * 8 + 7)
#define                                 P1M_bit             _BIT_ACCESS(CCP1CON,7)
// PWM1CON<PDC0>
extern volatile __bit                   PDC0                __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 PDC0_bit            _BIT_ACCESS(PWM1CON,0)
// PWM1CON<PDC1>
extern volatile __bit                   PDC1                __at(0xB1);	// @ (0x16 * 8 + 1)
#define                                 PDC1_bit            _BIT_ACCESS(PWM1CON,1)
// PWM1CON<PDC2>
extern volatile __bit                   PDC2                __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 PDC2_bit            _BIT_ACCESS(PWM1CON,2)
// PWM1CON<PDC3>
extern volatile __bit                   PDC3                __at(0xB3);	// @ (0x16 * 8 + 3)
#define                                 PDC3_bit            _BIT_ACCESS(PWM1CON,3)
// PWM1CON<PDC4>
extern volatile __bit                   PDC4                __at(0xB4);	// @ (0x16 * 8 + 4)
#define                                 PDC4_bit            _BIT_ACCESS(PWM1CON,4)
// PWM1CON<PDC5>
extern volatile __bit                   PDC5                __at(0xB5);	// @ (0x16 * 8 + 5)
#define                                 PDC5_bit            _BIT_ACCESS(PWM1CON,5)
// PWM1CON<PDC6>
extern volatile __bit                   PDC6                __at(0xB6);	// @ (0x16 * 8 + 6)
#define                                 PDC6_bit            _BIT_ACCESS(PWM1CON,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// PMADRH<PMADRH0>
extern volatile __bit                   PMADRH0             __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 PMADRH0_bit         _BIT_ACCESS(PMADRH,0)
// PMADRH<PMADRH1>
extern volatile __bit                   PMADRH1             __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 PMADRH1_bit         _BIT_ACCESS(PMADRH,1)
// PMADRH<PMADRH2>
extern volatile __bit                   PMADRH2             __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 PMADRH2_bit         _BIT_ACCESS(PMADRH,2)
// PMADRL<PMADRL0>
extern volatile __bit                   PMADRL0             __at(0x4D0);	// @ (0x9A * 8 + 0)
